Revit 2026 API

# DefinitionGroup Class

---

The DefinitionGroup is a container that is used to hold shared parameter definitions on disk.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDefinitionGroup

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DefinitionGroup : APIObject
```
```vb
Public Class DefinitionGroup
	Inherits APIObject
```
```cpp
public ref class DefinitionGroup : public APIObject
```
```fsharp
type DefinitionGroup =
    class
        inherit APIObject
    end
```

The DefinitionGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Definitions | The Definitions property returns an object that contains all the shared parameter definitions within the group. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Name | Returns the name of the parameter group. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Groups are used for logical arrangement of the shared parameters into meaningful sets. Through the DefinitionGroup object new shared parameter definitions can be made.

#### Reference

Autodesk.Revit.DB Namespace